# GetSpecificFittingAngles Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..GetSpecificFittingAngles Method
ElectricalSetting Class See Also
---
Gets the list of specific fitting angles.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<double> GetSpecificFittingAngles()
```

Visual Basic
---
```text
Public Function GetSpecificFittingAngles As IList(Of Double)
```

Visual C++
---
```text
public:
IList<double>^ GetSpecificFittingAngles()
```

# ### Return Value
Angles (in degrees).
# Remarks
Revit will only use the angles specified during the cable tray or conduit layout or modifying the layout. When laying out the cable tray or conduit, if the angle between two cable trays or conduits is close to the allowed angle, The specific angle is used for that cable tray or conduit fitting.
# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace